[
  {
    "title": "Lesson 1: G'day Mate",
    "difficulty": "Beginner",
    "content": "G'day mate. How's it going? She'll be right. No worries."
  },
  {
    "title": "Lesson 2: The Barbie",
    "difficulty": "Beginner",
    "content": "Let's have a barbie this arvo. Grab your sunnies and thongs."
  },
  {
    "title": "Lesson 3: Aussie Lingo",
    "difficulty": "Beginner",
    "content": "He's a true blue Aussie legend. What a bloody ripper!"
  },
  {
    "title": "Lesson 4: Taking a Day Off",
    "difficulty": "Beginner",
    "content": "I might chuck a sickie tomorrow. I'm feeling a bit crook."
  },
  {
    "title": "Lesson 5: Classic Snacks",
    "difficulty": "Beginner",
    "content": "Pass me the tomato sauce for the sausage sizzle. Want a lamington?"
  },
  {
    "title": "Lesson 6: On the Road",
    "difficulty": "Beginner",
    "content": "We drove the ute out to the bush. Chuck a u-ey at the next roundabout."
  },
  {
    "title": "Lesson 7: A Cuppa",
    "difficulty": "Beginner",
    "content": "Let's stop for a cuppa and a biscuit. I'll shout this round."
  },
  {
    "title": "Lesson 8: The Flat White",
    "difficulty": "Intermediate",
    "content": "A flat white is a popular coffee drink that was likely invented in Australia. It is made with a strong shot of espresso and steamed milk, with just a thin layer of foam on top."
  },
  {
    "title": "Lesson 9: Vegemite on Toast",
    "difficulty": "Intermediate",
    "content": "Vegemite on toast is a classic Aussie breakfast. It's a dark, salty spread made from leftover brewers' yeast extract. It is certainly an acquired taste for many people."
  },
  {
    "title": "Lesson 10: Bondi Beach",
    "difficulty": "Intermediate",
    "content": "Going for a surf at Bondi Beach is a popular weekend activity for many Sydneysiders. Remember to always swim between the red and yellow flags where the lifeguards can see you."
  },
  {
    "title": "Lesson 11: The Australian Outback",
    "difficulty": "Intermediate",
    "content": "The Australian Outback is a vast, remote, and arid region. It is home to unique and hardy wildlife like red kangaroos, emus, and dingoes, which have all adapted to the harsh climate."
  },
  {
    "title": "Lesson 12: Summer of Cricket",
    "difficulty": "Intermediate",
    "content": "Cricket is the nation's most popular sport during the summer months. The Boxing Day Test match, held annually in Melbourne, is a massive sporting event that captures the country's attention."
  },
  {
    "title": "Lesson 13: The Great Barrier Reef",
    "difficulty": "Intermediate",
    "content": "The Great Barrier Reef is the world's largest coral reef system. It is composed of over 2,900 individual reefs and 900 islands stretching for over 2,300 kilometres."
  },
  {
    "title": "Lesson 14: The Melbourne Cup",
    "difficulty": "Intermediate",
    "content": "The Melbourne Cup is Australia's most famous annual horse race. It is a 3,200 metre race for horses three years old and over, and is known locally as 'the race that stops a nation'."
  },
  {
    "title": "Lesson 15: The Pavlova Debate",
    "difficulty": "Advanced",
    "content": "The history of the pavlova is a hotly debated topic between Australia and New Zealand. Both nations passionately claim to have invented the meringue-based dessert, which was named in honour of the Russian ballerina Anna Pavlova during her tours in the 1920s. Regardless of its origin, it remains a staple at Christmas gatherings and celebrations, typically topped with whipped cream and fresh fruit."
  },
  {
    "title": "Lesson 16: The Film 'The Castle'",
    "difficulty": "Advanced",
    "content": "The film 'The Castle' is a beloved Australian comedy that perfectly captures the spirit of the underdog. The Kerrigan family's fight to save their home from compulsory acquisition is full of iconic, quotable lines like 'Tell him he's dreamin'' and 'It's the vibe of the thing'. These phrases have become a cherished part of the national lexicon, representing a triumph for the little guy."
  },
  {
    "title": "Lesson 17: Compulsory Voting",
    "difficulty": "Advanced",
    "content": "The Australian federal electoral system includes compulsory voting for all registered citizens over the age of eighteen. This ensures a high voter turnout compared to many other western democracies. It is often accompanied by a 'democracy sausage' sizzle at the local polling booth, a simple barbecue that has become a cherished and delicious tradition on election day."
  },
  {
    "title": "Lesson 18: Australian Art",
    "difficulty": "Advanced",
    "content": "From the ancient and sacred rock art of the Indigenous peoples in Kakadu National Park to the modern galleries of Melbourne's laneways, Australian art is incredibly diverse. It reflects the country's unique and often harsh landscape, its dynamic multicultural society, and its complex, layered history. The art tells the story of this continent and its people over many thousands of years."
  },
  {
    "title": "Lesson 19: Waltzing Matilda",
    "difficulty": "Advanced",
    "content": "Banjo Paterson's famous poem \"Waltzing Matilda\" is Australia's best-known bush ballad and has been described as the country's unofficial national anthem. The song tells the story of an itinerant worker, or 'swagman', who makes a cup of billy tea by a billabong. He captures a jumbuck, a local term for a sheep, to eat. When the sheep's owner arrives with troopers to arrest him, the swagman drowns himself in the billabong."
  },
  {
    "title": "Lesson 20: The Sydney Opera House",
    "difficulty": "Advanced",
    "content": "The Sydney Opera House, with its distinctive sail-like shells, is a true masterpiece of 20th-century architecture and a symbol of modern Australia. Designed by the Danish architect Jørn Utzon, its construction was a remarkable and often controversial feat of engineering. It was formally opened by Queen Elizabeth II in 1973 and is now one of the world's most famous and photographed landmarks, hosting over 1,500 performances each year."
  }
]
